# Core CLI tools
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"

# Modern CLI replacements
brew "eza"             # ls replacement
brew "bat"             # cat replacement
brew "ripgrep"         # grep replacement
brew "fd"              # find replacement
brew "git-delta"       # diff pager
brew "zoxide"          # smart cd
brew "fzf"             # fuzzy finder
brew "lazygit"         # git TUI
brew "glow"            # markdown renderer for terminal

# Shell
brew "starship"        # prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Dev tools
brew "tmux"
brew "mosh"           # low-latency shell with local echo (used over Tailscale)
brew "rsync"          # GNU rsync ≥ 3 — Apple's openrsync lacks --secluded-args (needed by `gust push`)
brew "neovim"
brew "node"
brew "pnpm"
brew "just"
brew "shellcheck"       # pre-commit lint for *.sh
brew "libpq"           # psql/pg_dump client (keg-only; PATH set in zsh/core.zsh)

# Project: iphone-shortcuts (~/code/personal/iphone-shortcuts)
# Cherri compiles a DSL to .shortcut files; LLM-driven authoring lives in that repo.
tap "electrikmilk/cherri"
brew "cherri"

# GUI apps
cask "ghostty"

# Container runtime. Provides:
#   - `ssh orb` host (via `Include ~/.orbstack/ssh/config` in machine/mac/ssh/config)
#   - Docker engine for `just test` (full integration suite in clean containers)
# Docker Desktop is the heavier alternative; pick one.
cask "orbstack"
# cask "docker"
